moyoulingsen/shiyanshianquan/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_CAMERA_SC2336=y
CONFIG_CAM_CTRL_SPI_ENABLE=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_LABGUARD_SENSOR_I2C_PORT=1
CONFIG_LABGUARD_SENSOR_I2C_ENABLE=y
CONFIG_LABGUARD_SENSOR_I2C_SDA_GPIO=2
CONFIG_LABGUARD_SENSOR_I2C_SCL_GPIO=3
CONFIG_LABGUARD_MQ2_ACTIVE_LOW=y
CONFIG_LABGUARD_ACTUATOR_LIGHT_GPIO=32
CONFIG_LABGUARD_ACTUATOR_LIGHT_DATA_GPIO=33
CONFIG_LABGUARD_ACTUATOR_LIGHT_LED_COUNT=8
CONFIG_LABGUARD_AUDIO_PROMPT_I2S_WS_GPIO=22

# SC2336 native 1024x600 RAW8 matches the EK79007 panel and camera pipeline.
CONFIG_CAMERA_SC2336_MIPI_RAW8_1024X600_30FPS=y
CONFIG_CAMERA_SC2336_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
